#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ОстаткиТоваров Приход
	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Если ТекСтрокаТовары.ОкончаниеСрокаГодности < Дата Тогда
			СообщитьОбОшибке(ТекСтрокаТовары);
			Отказ = Истина;
		КонецЕсли;
		
		Движение = Движения.ОстаткиТоваров.ДобавитьПриход();
		Движение.Период = Дата;
		ЗаполнитьЗначенияСвойств(Движение, ТекСтрокаТовары);
		
	КонецЦикла;

КонецПроцедуры

Процедура СообщитьОбОшибке(Знач ТекСтрокаТовары)
	
	Перем Сообщение;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Нельзя оприходовать товар с истекшим сроком годности";
	Сообщение.Поле = "Товары[" + (ТекСтрокаТовары.НомерСтроки - 1) + "].ОкончаниеСрокаГодности";
	Сообщение.УстановитьДанные(ЭтотОбъект);
	Сообщение.Сообщить();
	
КонецПроцедуры

#КонецОбласти