#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	ЗаполнитьДанныеОСрокеГодности();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыДатаПроизводстваПриИзменении(Элемент)
	ЗаполнитьДанныеОСрокеГодности();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСрокГодностиПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанные.ОкончаниеСрокаГодности = 	ОбщегоНазначенияВызовСервера.ДобавитьКДатеКоличествоДней(ТекущиеДанные.ДатаПроизводства, ТекущиеДанные.СрокГодности);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыОкончаниеСрокаГодностиПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанные.СрокГодности = ОбщегоНазначенияВызовСервера.ВычислитьКоличествоДнейМеждуДатами(ТекущиеДанные.ОкончаниеСрокаГодности, ТекущиеДанные.ДатаПроизводства);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьДанныеОСрокеГодности()

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ДанныеОСрокеГодности = ОбщегоНазначенияВызовСервера.ПолучитьДанныеОСрокеГодностиНоменклатуры(ТекущиеДанные.Номенклатура, ТекущиеДанные.ДатаПроизводства);
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ДанныеОСрокеГодности);

КонецПроцедуры

#КонецОбласти
